data/INRA/data5/README.org
#+STARTUP: showeverything
#+OPTIONS: ':nil *:t -:t ::t <:t H:5 \n:nil ^:{} arch:headline author:t broken-links:nil
#+OPTIONS: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:nil title:t toc:5
#+OPTIONS: todo:t |:t
#+TITLE: INRA data5 errors
#+DATE: <2019-02-08>
#+AUTHOR: Vladimir Alexiev
#+EMAIL: vladimir.alexiev@ontotext.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.3.1 (Org mode 9.1.13)

* Instructions
- HTML-rendered version of this file: https://rawgit.com/BigDataGrapes-EU/ontology/master/data/INRA/data5/README.html
- First read [[https://docs.google.com/document/d/1TfWhafz2S_Py9rshf8bmaSyNyalelqEDXU7RpxJ4zEw/edit#][data-validation-handling]]
- This file lists errors/problems found in some of the files.
  But often the same error applies to several terms in the same file, or even to several files.
  So check each reported error against all files and all their contents.
  - Eg the inapplicability of ~dct:created~ to ~time:Instant~ is reported 
    for the first observation file ~2016vendanges_transf_parsed.ttl~ but applies to all observation files

* Recommendations [26/38]

** Prefixes [3/3]
*** DONE Turtle prefix format
You use the SPARQL syntax for prefixes
  : PREFIX inra_obj:   <http://vinnotec.supagro.inra.fr/public/Pr/>
  While this is not an error (Turtle 1.1 supports this syntax), it's better to use the older syntax
  : @prefix inra_obj:   <http://vinnotec.supagro.inra.fr/public/Pr/> .
*** DONE Check against prefixes.ttl
Check your prefixes against prefixes.ttl and use exactly the same. 
Consult http://prefix.cc for the most popular prefixes to use.
- Use ~dct:~ not ~dcterms:~ for DC Terms: both are valid, but the former is more popular
- Use ~geo:~ not ~gsp:~ for GeoSPARQL, the former is a lot more popular
*** DONE Namespaces are not suggestive
These namespaces do not suggest they hold time and observations respectively
  #+BEGIN_SRC Turtle
  PREFIX context:    <http://www.phenome-fppn.fr/m3p/eventInsertion_ARCH2017-03-30>  
  PREFIX inra_data:  <http://vinnotec.supagro.inra.fr/public/Pr/data/>   
  #+END_SRC

** General [1/2]
These files use the following INRA ontologies/resources
: inra_obj:   <http://vinnotec.supagro.inra.fr/public/Pr/>
: inra_data:  <http://vinnotec.supagro.inra.fr/public/Pr/data/>
: inra_agent: <http://vinnotec.supagro.inra.fr/public/Pr/agent/>
: inra_code:  <http://vinnotec.supagro.inra.fr/public/Pr/code/>
: inra_onto:  <http://vinnotec.supagro.inra.fr/public/Pr/onto/>
*** TODO Should be resolvable
These (at least the last two) don't resolve, and return this:
: Veuillez vous connecter pour avoir accès à cette page
I see the latter is defined in ~INRA_Variables.ttl~, but at some point should become resolvable.
*** DONE Leave empty line
Leave empty line between subject blocks ("paragraphs") to better delineate them:
  #+BEGIN_SRC Turtle
context:instant_e1ba2667-2a37-4a42-b157-7ac07bfc458e rdf:type time:Instant ;
   time:inXSDDateTimeStamp "2016-08-24T12:00:00+01:00"^^xsd:dateTimeStamp ;
   dcterms:created "2018-07-12T18:52:00.012981"^^xsd:dateTime .
# empty line HERE
inra_data:a7fc3837-9c8b-4e4b-a79d-aad0b2876086 rdf:type oepo:Observation ;
   time:hasTime context:instant_e1ba2667-2a37-4a42-b157-7ac07bfc458e ;
   ofpe:Operator inra_agent:fabien.robert ; 
  #+END_SRC

** 2016_harvest.ttl [6/6]
Harvest observations: ~inra_onto:Poidsvendangegpesee~ (grams harvested)
