data/INRA/old/data5/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>INRA data5 errors</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vladimir Alexiev" />
</head>
<body>
<div id="content">
<h1 class="title">INRA data5 errors</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org80e46ec">Instructions</a></li>
<li><a href="#org93478f1">Recommendations <code>[26/38]</code></a>
<ul>
<li><a href="#org499102e">Prefixes <code>[3/3]</code></a>
<ul>
<li><a href="#orgc2b20d2"><span class="done DONE">DONE</span> Turtle prefix format</a></li>
<li><a href="#orge8aae1c"><span class="done DONE">DONE</span> Check against prefixes.ttl</a></li>
<li><a href="#org9e221c2"><span class="done DONE">DONE</span> Namespaces are not suggestive</a></li>
</ul>
</li>
<li><a href="#org3b12e76">General <code>[1/2]</code></a>
<ul>
<li><a href="#org3fc967c"><span class="todo TODO">TODO</span> Should be resolvable</a></li>
<li><a href="#orgb591d78"><span class="done DONE">DONE</span> Leave empty line</a></li>
</ul>
</li>
<li><a href="#org1f652f2">2016_harvest.ttl <code>[6/6]</code></a>
<ul>
<li><a href="#org9ad5006"><span class="done DONE">DONE</span> syntax error</a></li>
<li><a href="#org70573e2"><span class="done DONE">DONE</span> dct:created is inappropraite</a></li>
<li><a href="#org750a8ff"><span class="done DONE">DONE</span> aeo:involvedIn</a></li>
<li><a href="#orgd54f2c7"><span class="done DONE">DONE</span> Class vs Property</a></li>
<li><a href="#orgf33c0ee"><span class="done DONE">DONE</span> No georeference?</a></li>
<li><a href="#orgce7be7b"><span class="done DONE">DONE</span> rdf:value?</a></li>
</ul>
</li>
<li><a href="#org422ee31"><span class="todo TODO">TODO</span> 2016_sensoryAnalysisEssay_ALFColomb.ttl</a></li>
<li><a href="#orgc04cd28">ComposantesGrappe_transf_parsed.ttl <code>[2/2]</code></a>
<ul>
<li><a href="#org00dd5f9"><span class="done DONE">DONE</span> invalid DateTimeStamp</a></li>
<li><a href="#org3d8f3bb"><span class="done DONE">DONE</span> missing rdf:value</a></li>
</ul>
</li>
<li><a href="#orgd890aaf">ComposantesVendanges_transf_parsed.ttl <code>[1/2]</code></a>
<ul>
<li><a href="#org4bc16ec"><span class="done DONE">DONE</span> missing rdf:value</a></li>
</ul>
</li>
<li><a href="#org446d2e7"><span class="todo TODO">TODO</span> EndOfAlcoholicfermentation.ttl</a></li>
<li><a href="#org3f13276">fieldsLocalisationPR_parsed.ttl <code>[6/6]</code></a>
<ul>
<li><a href="#org7f675cb"><span class="done DONE">DONE</span> Use QUDT not quty</a></li>
<li><a href="#orga3d2a47"><span class="done DONE">DONE</span> Don't use dbo: for units</a></li>
<li><a href="#orgcf7ef88"><span class="done DONE">DONE</span> Where is the grape variety indicated?</a></li>
<li><a href="#orgbfe5be4"><span class="done DONE">DONE</span> Fix polygon geometry</a></li>
<li><a href="#org365d718"><span class="done DONE">DONE</span> geo:Polygon vs geo:Geometry</a></li>
<li><a href="#org5d1c879"><span class="done DONE">DONE</span> Declare geo:Feature</a></li>
</ul>
</li>
<li><a href="#org29817da">INRA_Variables.ttl <code>[6/6]</code></a>
<ul>
<li><a href="#org095c43e"><span class="done DONE">DONE</span> Namespace hijacking</a></li>
<li><a href="#org6ab9510"><span class="done DONE">DONE</span> Use English class names</a></li>
<li><a href="#org47b5d37"><span class="done DONE">DONE</span> Define labels</a></li>
<li><a href="#orgdffcb56"><span class="done DONE">DONE</span> Conform to Property Naming Convention</a></li>
<li><a href="#org33a302c"><span class="done DONE">DONE</span> Can't use CO_UO "gram"</a></li>
<li><a href="#org0ecdb75"><span class="done DONE">DONE</span> Missing CO_UO Term</a></li>
</ul>
</li>
<li><a href="#orgf2f1fa6"><span class="done DONE">DONE</span> EndOfAlcoholicfermentation.ttl</a></li>
<li><a href="#org508156b"><span class="todo TODO">TODO</span> Maturite_transf_parsed.ttl</a></li>
<li><a href="#org29ecabb"><span class="todo TODO">TODO</span> MaturiteAnthocyanes_transf_parsed.ttl</a></li>
<li><a href="#orgee0ae65"><span class="todo TODO">TODO</span> MaturiteJus_transf_parsed.ttl</a></li>
<li><a href="#org116e27d"><span class="todo TODO">TODO</span> MaturiteSunAgri2B_transf_parsed.ttl</a></li>
<li><a href="#org2573f17">must_transf_parsed.ttl <code>[0/1]</code></a>
<ul>
<li><a href="#org8282a64"><span class="todo TODO">TODO</span> Syntax error</a></li>
</ul>
</li>
<li><a href="#org19be6bf">Suivifermentations_transf_parsed.ttl <code>[0/4]</code></a>
<ul>
<li><a href="#org08183f0"><span class="todo TODO">TODO</span> Syntax error</a></li>
<li><a href="#org65789e4"><span class="todo TODO">TODO</span> Class vs Property</a></li>
<li><a href="#org444aa11"><span class="todo TODO">TODO</span> Where are inra_codes defined?</a></li>
<li><a href="#orgebd0868"><span class="todo TODO">TODO</span> Inconsistent URLs for some codes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org11f857b">Scratch Pad <code>[/]</code></a>
<ul>
<li><a href="#orgfe94c94">Capturing All Plot Data</a></li>
<li><a href="#org1aa47b2"><span class="done DONE">DONE</span> Minor things</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org80e46ec" class="outline-2">
<h2 id="org80e46ec">Instructions</h2>
<div class="outline-text-2" id="text-org80e46ec">
<ul class="org-ul">
<li>HTML-rendered version of this file: <a href="https://rawgit.com/BigDataGrapes-EU/ontology/master/data/INRA/data5/README.html">https://rawgit.com/BigDataGrapes-EU/ontology/master/data/INRA/data5/README.html</a></li>
<li>First read <a href="https://docs.google.com/document/d/1TfWhafz2S_Py9rshf8bmaSyNyalelqEDXU7RpxJ4zEw/edit#">data-validation-handling</a></li>
<li>This file lists errors/problems found in some of the files.
But often the same error applies to several terms in the same file, or even to several files.
So check each reported error against all files and all their contents.
<ul class="org-ul">
<li>Eg the inapplicability of <code>dct:created</code> to <code>time:Instant</code> is reported 
for the first observation file <code>2016vendanges_transf_parsed.ttl</code> but applies to all observation files</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org93478f1" class="outline-2">
<h2 id="org93478f1">Recommendations <code>[26/38]</code></h2>
<div class="outline-text-2" id="text-org93478f1">
</div>
<div id="outline-container-org499102e" class="outline-3">
<h3 id="org499102e">Prefixes <code>[3/3]</code></h3>
<div class="outline-text-3" id="text-org499102e">
</div>
<div id="outline-container-orgc2b20d2" class="outline-4">
<h4 id="orgc2b20d2"><span class="done DONE">DONE</span> Turtle prefix format</h4>
<div class="outline-text-4" id="text-orgc2b20d2">
<p>
You use the SPARQL syntax for prefixes
</p>
<pre class="example">
PREFIX inra_obj:   &lt;http://vinnotec.supagro.inra.fr/public/Pr/&gt;

</pre>
<p>
While this is not an error (Turtle 1.1 supports this syntax), it's better to use the older syntax
</p>
<pre class="example">
@prefix inra_obj:   &lt;http://vinnotec.supagro.inra.fr/public/Pr/&gt; .

</pre>
</div>
</div>
<div id="outline-container-orge8aae1c" class="outline-4">
<h4 id="orge8aae1c"><span class="done DONE">DONE</span> Check against prefixes.ttl</h4>
<div class="outline-text-4" id="text-orge8aae1c">
<p>
Check your prefixes against prefixes.ttl and use exactly the same. 
Consult <a href="http://prefix.cc">http://prefix.cc</a> for the most popular prefixes to use.
</p>
<ul class="org-ul">
<li>Use <code>dct:</code> not <code>dcterms:</code> for DC Terms: both are valid, but the former is more popular</li>
<li>Use <code>geo:</code> not <code>gsp:</code> for GeoSPARQL, the former is a lot more popular</li>
</ul>
</div>
</div>
<div id="outline-container-org9e221c2" class="outline-4">
<h4 id="org9e221c2"><span class="done DONE">DONE</span> Namespaces are not suggestive</h4>
<div class="outline-text-4" id="text-org9e221c2">
<p>
These namespaces do not suggest they hold time and observations respectively
</p>
<div class="org-src-container">
<pre class="src src-Turtle">PREFIX <span style="color: #228b22;">context:</span><span style="color: #008b8b;"> </span>   <span style="color: #0000ff;">&lt;http://www.phenome-fppn.fr/m3p/eventInsertion_ARCH2017-03-30&gt;</span>  
PREFIX <span style="color: #228b22;">inra_data:</span><span style="color: #008b8b;"> </span> <span style="color: #0000ff;">&lt;http://vinnotec.supagro.inra.fr/public/Pr/data/&gt;</span>   
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b12e76" class="outline-3">
<h3 id="org3b12e76">General <code>[1/2]</code></h3>
<div class="outline-text-3" id="text-org3b12e76">
<p>
These files use the following INRA ontologies/resources
</p>
<pre class="example">
inra_obj:   &lt;http://vinnotec.supagro.inra.fr/public/Pr/&gt;
inra_data:  &lt;http://vinnotec.supagro.inra.fr/public/Pr/data/&gt;
inra_agent: &lt;http://vinnotec.supagro.inra.fr/public/Pr/agent/&gt;
inra_code:  &lt;http://vinnotec.supagro.inra.fr/public/Pr/code/&gt;
inra_onto:  &lt;http://vinnotec.supagro.inra.fr/public/Pr/onto/&gt;

</pre>
</div>
<div id="outline-container-org3fc967c" class="outline-4">
<h4 id="org3fc967c"><span class="todo TODO">TODO</span> Should be resolvable</h4>
<div class="outline-text-4" id="text-org3fc967c">
<p>
These (at least the last two) don't resolve, and return this:
</p>
<pre class="example">
Veuillez vous connecter pour avoir accès à cette page

</pre>
<p>
I see the latter is defined in <code>INRA_Variables.ttl</code>, but at some point should become resolvable.
</p>
</div>
</div>
<div id="outline-container-orgb591d78" class="outline-4">
<h4 id="orgb591d78"><span class="done DONE">DONE</span> Leave empty line</h4>
<div class="outline-text-4" id="text-orgb591d78">
<p>
Leave empty line between subject blocks ("paragraphs") to better delineate them:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">context:</span><span style="color: #008b8b;">instant_e1ba2667-2a37-4a42-b157-7ac07bfc458e</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">time:</span><span style="color: #008b8b;">Instant</span> ;
   <span style="color: #228b22;">time:</span><span style="color: #008b8b;">inXSDDateTimeStamp</span> <span style="color: #8b2252;">"2016-08-24T12:00:00+01:00"</span><span style="color: #008b8b;">^^xsd:dateTimeStamp</span> ;
   <span style="color: #228b22;">dcterms:</span><span style="color: #008b8b;">created</span> <span style="color: #8b2252;">"2018-07-12T18:52:00.012981"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">dateTime</span> .
<span style="color: #b22222;"># empty line HERE</span>
<span style="color: #228b22;">inra_data:</span><span style="color: #008b8b;">a7fc3837-9c8b-4e4b-a79d-aad0b2876086</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">oepo:</span><span style="color: #008b8b;">Observation</span> ;
   <span style="color: #228b22;">time:</span><span style="color: #008b8b;">hasTime</span> <span style="color: #228b22;">context:</span><span style="color: #008b8b;">instant_e1ba2667-2a37-4a42-b157-7ac07bfc458e</span> ;
   <span style="color: #228b22;">ofpe:</span><span style="color: #008b8b;">Operator</span> <span style="color: #228b22;">inra_agent:</span><span style="color: #008b8b;">fabien</span>.robert ; 
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1f652f2" class="outline-3">
<h3 id="org1f652f2">2016_harvest.ttl <code>[6/6]</code></h3>
<div class="outline-text-3" id="text-org1f652f2">
<p>
Harvest observations: <code>inra_onto:Poidsvendangegpesee</code> (grams harvested)
</p>
</div>
