data/INRA/data5/README.org
*** DONE syntax error
Some unquoted string
  #+BEGIN_SRC Turtle
  [line: 183, col: 24] Unrecognized: divers
  inra_obj:JARDIN-AMPELO divers rouge rdf:type aeo:Plot ;
  #+END_SRC
*** DONE dct:created is inappropraite
You can't "create" a time instant (it just exists!), so ~dcterms:created~ is inappropraite.
If you want to say when an event was converted (vs occurred), we could use PROV.
  #+BEGIN_SRC Turtle
  context:instant_e1ba2667-2a37-4a42-b157-7ac07bfc458e rdf:type time:Instant ;
     time:inXSDDateTimeStamp "2016-08-24T12:00:00+01:00"^^xsd:dateTimeStamp ;
     dcterms:created "2018-07-12T18:52:00.012981"^^xsd:dateTime .
  #+END_SRC
*** DONE aeo:involvedIn
"Lot" means a bunch of grapes processed together, that are used to make one "batch" of wine.
Many different grapes from different plots are put in the same lot, to get a good "bouquet".
It's used by INRA as follows:
  #+BEGIN_SRC Turtle
    inra_obj:81-CHARDONNAY rdf:type aeo:Plot ;
      aeo:involvedIn inra_code:Lot_FV-2016-002 ;
  #+END_SRC

~aeo:involvedIn~ is defined as "AgriExperiment involves different instances of AgriActivity and AgriEntity")
I'm not sure whether *involved in* can be used like this?
Maybe it can:
- a Lot is an "experiment" of combining different kinds 
- a Plot is an entity. However, you don't put Plots in bottles: you put the grapes grown on it (in a particular year) in the Lot.
  So the subject should be somethin like "grapes *harvest* from plot".

*** DONE Class vs Property
This is a class not property so it can't be used like this.
(In general I notice that all Bio-Agro ontologies have tons of classes but few properties)
  :    ofpe:Operator inra_agent:fabien.robert ;
*** DONE No georeference? 
This binds the observation to the plot: please confirm there's no need for a specific lat/long georeference
#+BEGIN_SRC Turtle
inra_obj:81-CHARDONNAY rdf:type aeo:Plot ;
   oepo:hasObservation inra_data:6870097e-13b9-4179-83c3-78450c0bb8ce .
#+END_SRC
*** DONE rdf:value?
I can't verify whether ~oepo:Observation~ takes ~rdf:value~ because OEPO doesn't define this.
Using ~rdf:value~ this way is fine, but we should specify it with an RDF Shape

# * ComposantesGrappe_transf_parsed.ttl [0/2]
# Observations: ~inra_onto:Nbbaiescomptage~ number of counting bays?!?
# ** DONE invalid DateTimeStamp
# : [line: 16, col: 28] Lexical form '10/09/16' not valid for datatype xsd:DateTimeStamp
# You should express it like this:
# : "2016-09-10"^^xsd:date
# (Note: ~xsd:DateTimeStamp~ is misspelt, should be ~xsd:dateTimeStamp~)
# ** DONE missing rdf:value
# : [line: 491, col: 47] Triples not terminated by DOT
# : inra_data:4e1956e2-eceb-477f-97a4-d22a919970b1 rdf:type oepo:Observation ;
# :   time:hasTime context:instant_39dec42b-9d84-4269-96f6-289d0d0ee782 ;
# :   oepo:hasVariable inra_onto:Nbbaiescomptage ;
# You have no rdf:value for this record, so you should omit the whole record (it's useless without the value).

** ComposantesVendanges_transf_parsed.ttl [1/2]
Observations: ~inra_onto:Nbgrappescomptage~ number of counted clusters?!?
*** DONE missing rdf:value
: [line: 50, col: 41] Triples not terminated by DOT

* variables.ttl [0/4]
Variable definitions
** DONE Namespace hijacking
Don't define terms of other ontologies
#+BEGIN_SRC Turtle
CO:variable_of  rdfs:subProperty_of  skos:related ;
	rdf:type		owl:ObjectProperty .
#+END_SRC
** DONE Use English class names
If you want to be more easily understood, please use English (or else I'll comment in Bulgarian ;-)
: inra_onto:Poidsvendangegpesee # weight as measured at vine picking
** DONE Define labels
Eg inra_onto:Glucose.fructoseg.lsequentiel.enzymatique needs a label such as "Glucose/fructose g/l sequential enzymatic"
** DONE Conform to Property Naming Convention
- Start with lowercase
- Use camelCase or underscore_separated names
So for the example above, use this name: ~glucose_fructose_g_l_sequential_enzymatic~
** DONE Can't use CO_UO "gram"
Checking whether ~inra_onto:Poidsvendangegpesee~ defines everything required to interpret the number.
#+BEGIN_SRC Turtle
inra_onto:Poidsvendangegpesee CO:variable_of CO_356:2000168 , CO_UO:0000021 , MMO:0000157 .
CO_356:2000168 rdfs:label "Yield"@en .
CO_UO:0000021 rdfs:label "g"@en; CO:scale_of CO_357:2000105 .
CO_357:2000105 rdfs:label "Ratio shoot root protocol"@en .
MMO:0000157 rdfs:label "digital scale post excision weight measurement" .
#+END_SRC
- I can't get the whole CO_UO from neither [[http://www.cropontology.org/rdf/UO:]] nor http://www.cropontology.org/rdf/UO.
  But individual terms are returned, eg http://www.cropontology.org/rdf/UO:0000021 returns Turtle.
- Unfortunately ~CO_UO:0000021~ defines "grams" relative to some Woody Plant feature.
  This is crazy because a gram is a gram, no matter what it's used to measure.
- It means you cannot use this "gram" for grapes. 
  Better use UO; or even better QUDT, which also defines relations/conversions of "gram" to other units.
** DONE Missing CO_UO Term
#+BEGIN_SRC Turtle
inra_onto:Glucose.fructoseg.lsequentiel.enzymatique CO:variable_of CO_356:2000057, CO_UO:0000175, MMO:0000388 .
#+END_SRC
However, http://www.cropontology.org/rdf/UO:0000175 is missing: unlike the above UO:0000021, this one returns nothing.

* area.ttl
Identifiers of fields

* plots_geometry 
Geometry of plot instances (previsously fieldsLocalisationPR_parsed.ttl) [0/7]

** DONE Use QUDT not quty
Uses some units ontology that's unknown to me:
#+BEGIN_SRC Turtle
@prefix quty: <http://www.telegraphis.net/ontology/measurement/quantity#>
#+END_SRC
This returns 404 Not Found. Better use QUDT, which is well known and maintained.
See presentation [[http://rawgit2.com/VladimirAlexiev/my/master/pres/20171025-Practical%20Semantic%20Modeling,%20SPARQL,%20RDF%20Shapes,%20IoT-WoT-UoM%20(201710).pptx},][20171025-Practical Semantic Modeling, SPARQL, RDF Shapes, IoT-WoT-UoM]].

*** DONE Don't use dbo: for units
Use a QUDT unit rather than a DBpedia URL as datatype literal:
#+BEGIN_SRC Turtle
   quty:area "1.37490"^^dbo:hectare
#+END_SRC

