data/INRA/old/data5/README.html
<div id="outline-container-org9ad5006" class="outline-4">
<h4 id="org9ad5006"><span class="done DONE">DONE</span> syntax error</h4>
<div class="outline-text-4" id="text-org9ad5006">
<p>
Some unquoted string
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">[line:</span><span style="color: #008b8b;"> 183,</span> <span style="color: #228b22;">col:</span><span style="color: #008b8b;"> 24]</span> <span style="color: #228b22;">Unrecognized:</span> <span style="color: #228b22;">divers</span>
<span style="color: #228b22;">inra_obj:</span><span style="color: #008b8b;">JARDIN-AMPELO</span> divers rouge <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">aeo:</span><span style="color: #008b8b;">Plot</span> ;
</pre>
</div>
</div>
</div>
<div id="outline-container-org70573e2" class="outline-4">
<h4 id="org70573e2"><span class="done DONE">DONE</span> dct:created is inappropraite</h4>
<div class="outline-text-4" id="text-org70573e2">
<p>
You can't "create" a time instant (it just exists!), so <code>dcterms:created</code> is inappropraite.
If you want to say when an event was converted (vs occurred), we could use PROV.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">context:</span><span style="color: #008b8b;">instant_e1ba2667-2a37-4a42-b157-7ac07bfc458e</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">time:</span><span style="color: #008b8b;">Instant</span> ;
   <span style="color: #228b22;">time:</span><span style="color: #008b8b;">inXSDDateTimeStamp</span> <span style="color: #8b2252;">"2016-08-24T12:00:00+01:00"</span><span style="color: #008b8b;">^^xsd:dateTimeStamp</span> ;
   <span style="color: #228b22;">dcterms:</span><span style="color: #008b8b;">created</span> <span style="color: #8b2252;">"2018-07-12T18:52:00.012981"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">dateTime</span> .
</pre>
</div>
</div>
</div>
<div id="outline-container-org750a8ff" class="outline-4">
<h4 id="org750a8ff"><span class="done DONE">DONE</span> aeo:involvedIn</h4>
<div class="outline-text-4" id="text-org750a8ff">
<p>
"Lot" means a bunch of grapes processed together, that are used to make one "batch" of wine.
Many different grapes from different plots are put in the same lot, to get a good "bouquet".
It's used by INRA as follows:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">inra_obj:</span><span style="color: #008b8b;">81-CHARDONNAY</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">aeo:</span><span style="color: #008b8b;">Plot</span> ;
  <span style="color: #228b22;">aeo:</span><span style="color: #008b8b;">involvedIn</span> <span style="color: #228b22;">inra_code:</span><span style="color: #008b8b;">Lot_FV-2016-002</span> ;
</pre>
</div>

<p>
<code>aeo:involvedIn</code> is defined as "AgriExperiment involves different instances of AgriActivity and AgriEntity")
I'm not sure whether <b>involved in</b> can be used like this?
Maybe it can:
</p>
<ul class="org-ul">
<li>a Lot is an "experiment" of combining different kinds</li>
<li>a Plot is an entity. However, you don't put Plots in bottles: you put the grapes grown on it (in a particular year) in the Lot.
So the subject should be somethin like "grapes <b>harvest</b> from plot".</li>
</ul>
</div>
</div>

<div id="outline-container-orgd54f2c7" class="outline-4">
<h4 id="orgd54f2c7"><span class="done DONE">DONE</span> Class vs Property</h4>
<div class="outline-text-4" id="text-orgd54f2c7">
<p>
This is a class not property so it can't be used like this.
(In general I notice that all Bio-Agro ontologies have tons of classes but few properties)
</p>
<pre class="example">
ofpe:Operator inra_agent:fabien.robert ;

</pre>
</div>
</div>
<div id="outline-container-orgf33c0ee" class="outline-4">
<h4 id="orgf33c0ee"><span class="done DONE">DONE</span> No georeference?</h4>
<div class="outline-text-4" id="text-orgf33c0ee">
<p>
This binds the observation to the plot: please confirm there's no need for a specific lat/long georeference
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">inra_obj:</span><span style="color: #008b8b;">81-CHARDONNAY</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">aeo:</span><span style="color: #008b8b;">Plot</span> ;
   <span style="color: #228b22;">oepo:</span><span style="color: #008b8b;">hasObservation</span> <span style="color: #228b22;">inra_data:</span><span style="color: #008b8b;">6870097e-13b9-4179-83c3-78450c0bb8ce</span> .
</pre>
</div>
</div>
</div>
<div id="outline-container-orgce7be7b" class="outline-4">
<h4 id="orgce7be7b"><span class="done DONE">DONE</span> rdf:value?</h4>
<div class="outline-text-4" id="text-orgce7be7b">
<p>
I can't verify whether <code>oepo:Observation</code> takes <code>rdf:value</code> because OEPO doesn't define this.
Using <code>rdf:value</code> this way is fine, but we should specify it with an RDF Shape
</p>
</div>
</div>
</div>

<div id="outline-container-org422ee31" class="outline-3">
<h3 id="org422ee31"><span class="todo TODO">TODO</span> 2016_sensoryAnalysisEssay_ALFColomb.ttl</h3>
<div class="outline-text-3" id="text-org422ee31">
<p>
Vladimir to check it out
</p>
</div>
</div>

<div id="outline-container-orgc04cd28" class="outline-3">
<h3 id="orgc04cd28">ComposantesGrappe_transf_parsed.ttl <code>[2/2]</code></h3>
<div class="outline-text-3" id="text-orgc04cd28">
<p>
Observations: <code>inra_onto:Nbbaiescomptage</code> number of counting bays?!?
</p>
</div>
<div id="outline-container-org00dd5f9" class="outline-4">
<h4 id="org00dd5f9"><span class="done DONE">DONE</span> invalid DateTimeStamp</h4>
<div class="outline-text-4" id="text-org00dd5f9">
<pre class="example">
[line: 16, col: 28] Lexical form '10/09/16' not valid for datatype xsd:DateTimeStamp

</pre>
<p>
You should express it like this:
</p>
<pre class="example">
"2016-09-10"^^xsd:date

</pre>
<p>
(Note: <code>xsd:DateTimeStamp</code> is misspelt, should be <code>xsd:dateTimeStamp</code>)
</p>
</div>
</div>
<div id="outline-container-org3d8f3bb" class="outline-4">
<h4 id="org3d8f3bb"><span class="done DONE">DONE</span> missing rdf:value</h4>
<div class="outline-text-4" id="text-org3d8f3bb">
<pre class="example">
[line: 491, col: 47] Triples not terminated by DOT
inra_data:4e1956e2-eceb-477f-97a4-d22a919970b1 rdf:type oepo:Observation ;
  time:hasTime context:instant_39dec42b-9d84-4269-96f6-289d0d0ee782 ;
  oepo:hasVariable inra_onto:Nbbaiescomptage ;

</pre>
<p>
You have no rdf:value for this record, so you should omit the whole record (it's useless without the value).
</p>
</div>
</div>
</div>

<div id="outline-container-orgd890aaf" class="outline-3">
<h3 id="orgd890aaf">ComposantesVendanges_transf_parsed.ttl <code>[1/2]</code></h3>
<div class="outline-text-3" id="text-orgd890aaf">
<p>
Observations: <code>inra_onto:Nbgrappescomptage</code> number of counted clusters?!?
</p>
</div>
<div id="outline-container-org4bc16ec" class="outline-4">
<h4 id="org4bc16ec"><span class="done DONE">DONE</span> missing rdf:value</h4>
<div class="outline-text-4" id="text-org4bc16ec">
<pre class="example">
[line: 50, col: 41] Triples not terminated by DOT

</pre>
</div>
</div>
</div>

<div id="outline-container-org446d2e7" class="outline-3">
<h3 id="org446d2e7"><span class="todo TODO">TODO</span> EndOfAlcoholicfermentation.ttl</h3>
<div class="outline-text-3" id="text-org446d2e7">
<p>
Vladimir to check it out
</p>
</div>
</div>

<div id="outline-container-org3f13276" class="outline-3">
<h3 id="org3f13276">fieldsLocalisationPR_parsed.ttl <code>[6/6]</code></h3>
<div class="outline-text-3" id="text-org3f13276">
<p>
Plot geometry
</p>
</div>
<div id="outline-container-org7f675cb" class="outline-4">
<h4 id="org7f675cb"><span class="done DONE">DONE</span> Use QUDT not quty</h4>
<div class="outline-text-4" id="text-org7f675cb">
<p>
Uses some units ontology that's unknown to me:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #a020f0;">@prefix</span> <span style="color: #228b22;">quty:</span><span style="color: #008b8b;"> </span><span style="color: #0000ff;">&lt;http://www.telegraphis.net/ontology/measurement/quantity#&gt;</span>
</pre>
</div>
<p>
This returns 404 Not Found. Better use QUDT, which is well known and maintained.
See presentation <a href="http://rawgit2.com/VladimirAlexiev/my/master/pres/20171025-Practical%20Semantic%20Modeling,%20SPARQL,%20RDF%20Shapes,%20IoT-WoT-UoM%20(201710).pptx%7D,">20171025-Practical Semantic Modeling, SPARQL, RDF Shapes, IoT-WoT-UoM</a>.
</p>
</div>
</div>

<div id="outline-container-orga3d2a47" class="outline-4">
<h4 id="orga3d2a47"><span class="done DONE">DONE</span> Don't use dbo: for units</h4>
<div class="outline-text-4" id="text-orga3d2a47">
<p>
Use a QUDT unit rather than a DBpedia URL as datatype literal:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">quty:</span><span style="color: #008b8b;">area</span> <span style="color: #8b2252;">"1.37490"</span><span style="color: #228b22;">^^dbo:</span>hectare
</pre>
</div>
</div>
</div>
