data/INRA/data5/README.org
*** TODO Syntax error
#+BEGIN_SRC Turtle
[line: 144, col: 26] Unrecognized: sec
#+END_SRC
Caused by space in the plot name: ~inra_obj:2016_HE1_Muscat sec~.

*** TODO Class vs Property
This is a class not property so it can't be used like this.
#+BEGIN_SRC Turtle
inra_data:32757c4a-15dd-4896-a3b9-970f33e6f756 rdf:type oepo:Observation ;
   foaf:Organization inra_code:16-1841 ;
#+END_SRC
~oepo:Observation~ needs some link to Agent, be that Operator or Organization

*** TODO Where are inra_codes defined?
These codes are used by data, but where are they defined?
#+BEGIN_SRC Turtle
inra_code:Cuve_BB1010 # FinFermentationsAlcoolique_transf_parsed
inra_code:BB1010      # Suivifermentations_transf_parsed
#+END_SRC
Codes are also used for organizations, so it may be better to define these as proper classes and call them something else:
#+BEGIN_SRC Turtle
 foaf:Organization inra_code:16-1841 ; # Suivifermentations_transf_parsed
#+END_SRC

*** TODO Inconsistent URLs for some codes
- ~inra_code:Lab_16-1841~ in FinFermentationsAlcoolique_transf_parsed.ttl, but merely 
- ~inra_code:16-1841~ in Suivifermentations_transf_parsed.ttl
One way to solve: 
#+BEGIN_SRC Turtle
# prefixes.ttl
@prefix inra_lab <...~inra_code/Lab_> .

# in data
inra_lab:16-1841 a foaf:Organization
#+END_SRC

* Scratch Pad [/]

** Capturing All Plot Data
~2016,HE1,Muscat sec~ should be converted to something like
#+BEGIN_SRC Turtle
inra_obj:2016_HE1_Muscat_sec a oepo:Experiment;
  plot inra_obj:TODO; ### where is the experiment being conducted
  year "2016"^^xsd:gYear;
  experiment_type inra_experiment:HE1;
  crop inra_variety:Muscat_sec.

# from some INRA database on varieties:
inra_variety:Muscat_sec a GrapeVariety;
  ...
#+END_SRC

** DONE Minor things
- add newline before each heading
- add new files to first-level headings
