data/INRA/old/data5/README.html

<div id="outline-container-org08183f0" class="outline-4">
<h4 id="org08183f0"><span class="todo TODO">TODO</span> Syntax error</h4>
<div class="outline-text-4" id="text-org08183f0">
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">[line:</span><span style="color: #008b8b;"> 144,</span> <span style="color: #228b22;">col:</span><span style="color: #008b8b;"> 26]</span> <span style="color: #228b22;">Unrecognized:</span> sec
</pre>
</div>
<p>
Caused by space in the plot name: <code>inra_obj:2016_HE1_Muscat sec</code>.
</p>
</div>
</div>

<div id="outline-container-org65789e4" class="outline-4">
<h4 id="org65789e4"><span class="todo TODO">TODO</span> Class vs Property</h4>
<div class="outline-text-4" id="text-org65789e4">
<p>
This is a class not property so it can't be used like this.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">inra_data:</span><span style="color: #008b8b;">32757c4a-15dd-4896-a3b9-970f33e6f756</span> <span style="color: #228b22;">rdf:</span><span style="color: #008b8b;">type</span> <span style="color: #228b22;">oepo:</span><span style="color: #008b8b;">Observation</span> ;
   <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">Organization</span> <span style="color: #228b22;">inra_code:</span><span style="color: #008b8b;">16-1841</span> ;
</pre>
</div>
<p>
<code>oepo:Observation</code> needs some link to Agent, be that Operator or Organization
</p>
</div>
</div>

<div id="outline-container-org444aa11" class="outline-4">
<h4 id="org444aa11"><span class="todo TODO">TODO</span> Where are inra_codes defined?</h4>
<div class="outline-text-4" id="text-org444aa11">
<p>
These codes are used by data, but where are they defined?
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">inra_code:</span><span style="color: #008b8b;">Cuve_BB1010</span> <span style="color: #b22222;"># </span><span style="color: #228b22;">FinFermentationsAlcoolique_transf_parsed</span>
<span style="color: #228b22;">inra_code:</span><span style="color: #008b8b;">BB1010</span>      <span style="color: #b22222;"># Suivifermentations_transf_parsed</span>
</pre>
</div>
<p>
Codes are also used for organizations, so it may be better to define these as proper classes and call them something else:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">Organization</span> <span style="color: #228b22;">inra_code:</span><span style="color: #008b8b;">16-1841</span> ; <span style="color: #b22222;"># Suivifermentations_transf_parsed</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebd0868" class="outline-4">
<h4 id="orgebd0868"><span class="todo TODO">TODO</span> Inconsistent URLs for some codes</h4>
<div class="outline-text-4" id="text-orgebd0868">
<ul class="org-ul">
<li><code>inra_code:Lab_16-1841</code> in FinFermentationsAlcoolique_transf_parsed.ttl, but merely</li>
<li><code>inra_code:16-1841</code> in Suivifermentations_transf_parsed.ttl</li>
</ul>
<p>
One way to solve: 
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #b22222;"># prefixes.ttl</span>
<span style="color: #a020f0;">@prefix</span> inr<span style="color: #a020f0;">a</span>_lab <span style="color: #0000ff;">&lt;...~inra_code/Lab_&gt;</span> .

<span style="color: #b22222;"># in data</span>
<span style="color: #228b22;">inra_lab:</span><span style="color: #008b8b;">16-1841</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">foaf:</span>Organization
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org11f857b" class="outline-2">
<h2 id="org11f857b">Scratch Pad <code>[/]</code></h2>
<div class="outline-text-2" id="text-org11f857b">
</div>
<div id="outline-container-orgfe94c94" class="outline-3">
<h3 id="orgfe94c94">Capturing All Plot Data</h3>
<div class="outline-text-3" id="text-orgfe94c94">
<p>
<code>2016,HE1,Muscat sec</code> should be converted to something like
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">inra_obj:</span><span style="color: #008b8b;">2016_HE1_Muscat_sec</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oepo:</span><span style="color: #008b8b;">Experiment</span>;
  plot <span style="color: #228b22;">inra_obj:</span><span style="color: #008b8b;">TODO</span>; <span style="color: #b22222;">### where is the experiment being conducted</span>
  year <span style="color: #8b2252;">"2016"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">gYear</span>;
  experiment_type <span style="color: #228b22;">inra_experiment:</span><span style="color: #008b8b;">HE1</span>;
  crop <span style="color: #228b22;">inra_variety:</span><span style="color: #008b8b;">Muscat_sec</span>.

<span style="color: #b22222;"># from some INRA database on varieties:</span>
<span style="color: #228b22;">inra_variety:</span><span style="color: #008b8b;">Muscat_sec</span> <span style="color: #a020f0;">a</span> GrapeVariety;
  ...
</pre>
</div>
</div>
</div>

<div id="outline-container-org1aa47b2" class="outline-3">
<h3 id="org1aa47b2"><span class="done DONE">DONE</span> Minor things</h3>
<div class="outline-text-3" id="text-org1aa47b2">
<ul class="org-ul">
<li>add newline before each heading</li>
<li>add new files to first-level headings</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-02-08 Fri 00:00</p>
<p class="author">Author: Vladimir Alexiev</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
